In [29]:
import pandas as pd
df = pd.read_csv("imdb_top_1000.csv")
df

,Poster_Link,Series_Title,Released_Year,Certificate,Runtime,Genre,IMDB_Rating,Overview,Meta_score,Director,Star1,Star2,Star3,Star4,No_of_Votes,Gross
0,https://m.media-amazon.com/images/M/MV5BMDFkYT...,The Shawshank Redemption,1994,A,142 min,Drama,9,Two imprisoned men bond over a number of years...,80,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler,2343110,"28,341,469"
1,https://m.media-amazon.com/images/M/MV5BM2MyNj...,The Godfather,1972,A,175 min,"Crime, Drama",9,An organized crime dynasty's aging patriarch t...,100,Francis Ford Coppola,Marlon Brando,Al Pacino,James Caan,Diane Keaton,1620367,"134,966,411"
2,https://m.media-amazon.com/images/M/MV5BMTMxNT...,The Dark Knight,2008,UA,152 min,"Action, Crime, Drama",9,When the menace known as the Joker wreaks havo...,84,Christopher Nolan,Christian Bale,Heath Ledger,Aaron Eckhart,Michael Caine,2303232,"534,858,444"
3,https://m.media-amazon.com/images/M/MV5BMWMwMG...,The Godfather: Part II,1974,A,202 min,"Crime, Drama",9,The early life and career of Vito Corleone in ...,90,Francis Ford Coppola,Al Pacino,Robert De Niro,Robert Duvall,Diane Keaton,1129952,"57,300,000"
4,https://m.media-amazon.com/images/M/MV5BMWU4N2...,12 Angry Men,1957,U,96 min,"Crime, Drama",9,A jury holdout attempts to prevent a miscarria...,96,Sidney Lumet,Henry Fonda,Lee J. Cobb,Martin Balsam,John Fiedler,689845,"4,360,000"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,https://m.media-amazon.com/images/M/MV5BNGEwMT...,Breakfast at Tiffany's,1961,A,115 min,"Comedy, Drama, Romance",8,A young New York socialite becomes interested ...,76,Blake Edwards,Audrey Hepburn,George Peppard,Patricia Neal,Buddy Ebsen,166544,NaN
996,https://m.media-amazon.com/images/M/MV5BODk3Yj...,Giant,1956,G,201 min,"Drama, Western",8,Sprawling epic covering the life of a Texas ca...,84,George Stevens,Elizabeth Taylor,Rock Hudson,James Dean,Carroll Baker,34075,NaN
997,https://m.media-amazon.com/images/M/MV5BM2U3Yz...,From Here to Eternity,1953,Passed,118 min,"Drama, Romance, War",8,"In Hawaii in 1941, a private is cruelly punish...",85,Fred Zinnemann,Burt Lancaster,Montgomery Clift,Deborah Kerr,Donna Reed,43374,"30,500,000"
998,https://m.media-amazon.com/images/M/MV5BZTBmMj...,Lifeboat,1944,NaN,97 min,"Drama, War",8,Several survivors of a torpedoed merchant ship...,78,Alfred Hitchcock,Tallulah Bankhead,John Hodiak,Walter Slezak,William Bendix,26471,NaN
999,https://m.media-amazon.com/images/M/MV5BMTY5OD...,The 39 Steps,1935,NaN,86 min,"Crime, Mystery, Thriller",8,A man in London tries to help a counter-espion...,93,Alfred Hitchcock,Robert Donat,Madeleine Carroll,Lucie Mannheim,Godfrey Tearle,51853,NaN

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Poster_Link    1000 non-null   object
 1   Series_Title   1000 non-null   object
 2   Released_Year  1000 non-null   object
 3   Certificate    899 non-null    object
 4   Runtime        1000 non-null   object
 5   Genre          1000 non-null   object
 6   IMDB_Rating    1000 non-null   float64
 7   Overview       1000 non-null   object
 8   Meta_score     843 non-null    float64
 9   Director       1000 non-null   object
 10  Star1          1000 non-null   object
 11  Star2          1000 non-null   object
 12  Star3          1000 non-null   object
 13  Star4          1000 non-null   object
 14  No_of_Votes    1000 non-null   int64
 15  Gross          831 non-null    object
dtypes: float64(2), int64(1), object(13)
memory usage: 125.1+ KB

In [31]:
df.shape

(1000, 16)

In [32]:
df.describe() #describe는 기본적으로 숫자정보를 보여주기위한

       IMDB_Rating  Meta_score  No_of_Votes
count         1000         843         1000
mean             8          78       273693
std              0          12       327373
min              8          28        25088
25%              8          70        55526
50%              8          79       138548
75%              8          87       374161
max              9         100      2343110

In [33]:
df["Released_Year_Num"] = pd.to_numeric(df["Released_Year"], errors='coerce')
df

,Poster_Link,Series_Title,Released_Year,Certificate,Runtime,Genre,IMDB_Rating,Overview,Meta_score,Director,Star1,Star2,Star3,Star4,No_of_Votes,Gross,Released_Year_Num
0,https://m.media-amazon.com/images/M/MV5BMDFkYT...,The Shawshank Redemption,1994,A,142 min,Drama,9,Two imprisoned men bond over a number of years...,80,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler,2343110,"28,341,469",1994
1,https://m.media-amazon.com/images/M/MV5BM2MyNj...,The Godfather,1972,A,175 min,"Crime, Drama",9,An organized crime dynasty's aging patriarch t...,100,Francis Ford Coppola,Marlon Brando,Al Pacino,James Caan,Diane Keaton,1620367,"134,966,411",1972
2,https://m.media-amazon.com/images/M/MV5BMTMxNT...,The Dark Knight,2008,UA,152 min,"Action, Crime, Drama",9,When the menace known as the Joker wreaks havo...,84,Christopher Nolan,Christian Bale,Heath Ledger,Aaron Eckhart,Michael Caine,2303232,"534,858,444",2008
3,https://m.media-amazon.com/images/M/MV5BMWMwMG...,The Godfather: Part II,1974,A,202 min,"Crime, Drama",9,The early life and career of Vito Corleone in ...,90,Francis Ford Coppola,Al Pacino,Robert De Niro,Robert Duvall,Diane Keaton,1129952,"57,300,000",1974
4,https://m.media-amazon.com/images/M/MV5BMWU4N2...,12 Angry Men,1957,U,96 min,"Crime, Drama",9,A jury holdout attempts to prevent a miscarria...,96,Sidney Lumet,Henry Fonda,Lee J. Cobb,Martin Balsam,John Fiedler,689845,"4,360,000",1957
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,https://m.media-amazon.com/images/M/MV5BNGEwMT...,Breakfast at Tiffany's,1961,A,115 min,"Comedy, Drama, Romance",8,A young New York socialite becomes interested ...,76,Blake Edwards,Audrey Hepburn,George Peppard,Patricia Neal,Buddy Ebsen,166544,NaN,1961
996,https://m.media-amazon.com/images/M/MV5BODk3Yj...,Giant,1956,G,201 min,"Drama, Western",8,Sprawling epic covering the life of a Texas ca...,84,George Stevens,Elizabeth Taylor,Rock Hudson,James Dean,Carroll Baker,34075,NaN,1956
997,https://m.media-amazon.com/images/M/MV5BM2U3Yz...,From Here to Eternity,1953,Passed,118 min,"Drama, Romance, War",8,"In Hawaii in 1941, a private is cruelly punish...",85,Fred Zinnemann,Burt Lancaster,Montgomery Clift,Deborah Kerr,Donna Reed,43374,"30,500,000",1953
998,https://m.media-amazon.com/images/M/MV5BZTBmMj...,Lifeboat,1944,NaN,97 min,"Drama, War",8,Several survivors of a torpedoed merchant ship...,78,Alfred Hitchcock,Tallulah Bankhead,John Hodiak,Walter Slezak,William Bendix,26471,NaN,1944
999,https://m.media-amazon.com/images/M/MV5BMTY5OD...,The 39 Steps,1935,NaN,86 min,"Crime, Mystery, Thriller",8,A man in London tries to help a counter-espion...,93,Alfred Hitchcock,Robert Donat,Madeleine Carroll,Lucie Mannheim,Godfrey Tearle,51853,NaN,1935

In [34]:
df.describe()

       IMDB_Rating  Meta_score  No_of_Votes  Released_Year_Num
count         1000         843         1000                999
mean             8          78       273693               1991
std              0          12       327373                 23
min              8          28        25088               1920
25%              8          70        55526               1976
50%              8          79       138548               1999
75%              8          87       374161               2009
max              9         100      2343110               2020

In [35]:
df.columns

Index(['Poster_Link', 'Series_Title', 'Released_Year', 'Certificate',
       'Runtime', 'Genre', 'IMDB_Rating', 'Overview', 'Meta_score', 'Director',
       'Star1', 'Star2', 'Star3', 'Star4', 'No_of_Votes', 'Gross',
       'Released_Year_Num'],
      dtype='object')

df_selected = df[['Series_Title', 'Released_Year_Num','Runtime', 'Genre', 'IMDB_Rating',
                  'No_of_Votes',]]
df_selected

In [36]:
avg_rating = df_selected['IMDB_Rating'].mean() #'IMDB_Rating 평점의 평균을 구하는
min_rating = df_selected['IMDB_Rating'].min()
max_rating = df_selected['IMDB_Rating'].max()

print(f"평균:{avg_rating}, 최소: {min_rating}, 최대: {max_rating}")

NameError: name 'df_selected' is not defined

In [ ]:
#No_of_Votes가 큰 순으로 정렬하기
#df_selected = df_selected.sort_values(by='No_of_Votes', ascending=False) #ascending = True가 기본값
df_selected = df_selected.sort_values(by='Genre', ascending=True)
df_selected

In [ ]:
df_selected["Runtime_num"] = df_selected["Runtime"].str.replace(" min", "")
df_selected["Runtime_num"] = df_selected["Runtime_num"].astype(int)
df_selected.sort_values(by='Runtime_num')

In [ ]:
#Boolean Filtering DataFrame명[조건식]

df_selected[df_selected["IMDB_Rating"] == df_selected["IMDB_Rating"].min()]

In [ ]:
total_votes = df_selected['No_of_Vote'].sum()
avg_votes = df_selected['No_of_Vote'].mean()

In [37]:
#Week4 2nd Class
import pandas as pd
df = pd.read_csv("seoul_apartment.csv")
df.head()

,NO,시군구,번지,본번,부번,단지명,전용면적(㎡),계약년월,계약일,거래금액(만원),층,건축년도,도로명
0,1,서울특별시 종로구 사직동,9,9,0,광화문스페이스본(101동~105동),95,200811,3,63000,6,2008,사직로8길 4
1,2,서울특별시 종로구 사직동,9,9,0,광화문스페이스본(101동~105동),147,200810,10,97000,13,2008,사직로8길 4
2,3,서울특별시 종로구 사직동,9,9,0,광화문스페이스본(101동~105동),147,200810,7,100000,1,2008,사직로8길 4
3,4,서울특별시 종로구 사직동,9,9,0,광화문스페이스본(101동~105동),147,200810,1,95000,12,2008,사직로8길 4
4,5,서울특별시 종로구 사직동,9,9,0,광화문스페이스본(101동~105동),147,200809,26,95000,11,2008,사직로8길 4

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260226 entries, 0 to 1260225
Data columns (total 13 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   NO        1260226 non-null  int64
 1   시군구       1260226 non-null  object
 2   번지        1260226 non-null  object
 3   본번        1260226 non-null  int64
 4   부번        1260226 non-null  int64
 5   단지명       1260226 non-null  object
 6   전용면적(㎡)   1260226 non-null  float64
 7   계약년월      1260226 non-null  int64
 8   계약일       1260226 non-null  int64
 9   거래금액(만원)  1260226 non-null  int64
 10  층         1260226 non-null  int64
 11  건축년도      1260226 non-null  int64
 12  도로명       1260226 non-null  object
dtypes: float64(1), int64(8), object(4)
memory usage: 125.0+ MB

In [ ]:
pd.set_option("display.float_format", "{:.0f}".format)
df.describe()

In [ ]:
df.sort_values(by="층")

In [53]:
df.groupby("시군구")["거래금액(만원)"].mean()
df["평균거래금액"] = df.groupby("시군구")["거래금액(만원)"].transform("mean")
df

,NO,시군구,번지,본번,부번,단지명,전용면적(㎡),계약년월,계약일,거래금액(만원),층,건축년도,도로명,평균거래금액
0,1,서울특별시 종로구 사직동,9,9,0,광화문스페이스본(101동~105동),95,200811,3,63000,6,2008,사직로8길 4,108363
1,2,서울특별시 종로구 사직동,9,9,0,광화문스페이스본(101동~105동),147,200810,10,97000,13,2008,사직로8길 4,108363
2,3,서울특별시 종로구 사직동,9,9,0,광화문스페이스본(101동~105동),147,200810,7,100000,1,2008,사직로8길 4,108363
3,4,서울특별시 종로구 사직동,9,9,0,광화문스페이스본(101동~105동),147,200810,1,95000,12,2008,사직로8길 4,108363
4,5,서울특별시 종로구 사직동,9,9,0,광화문스페이스본(101동~105동),147,200809,26,95000,11,2008,사직로8길 4,108363
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1260221,54409,서울특별시 강동구 강일동,670,670,0,강일리버파크5단지,85,201101,10,34907,1,2009,아리수로97길 20,48788
1260222,54410,서울특별시 강동구 강일동,670,670,0,강일리버파크5단지,85,201101,8,42000,4,2009,아리수로97길 20,48788
1260223,54411,서울특별시 강동구 강일동,673,673,0,강일리버파크4단지,85,201101,6,36889,2,2009,아리수로97길 19,48788
1260224,54412,서울특별시 강동구 강일동,670,670,0,강일리버파크5단지,85,201101,5,42000,8,2009,아리수로97길 20,48788
1260225,54413,서울특별시 강동구 강일동,670,670,0,강일리버파크5단지,60,201101,3,19006,7,2009,아리수로97길 20,48788

In [52]:
df.groupby("시군구").filter(lambda x: x[ "거래금액(만원)"].mean() >= 300000)

,NO,시군구,번지,본번,부번,단지명,전용면적(㎡),계약년월,계약일,거래금액(만원),층,건축년도,도로명
123026,75011,서울특별시 종로구 신문로2가,171,171,0,디팰리스,148,202009,23,321000,17,2020,새문안로2길 10
123027,75012,서울특별시 종로구 신문로2가,171,171,0,디팰리스,119,202012,2,230000,11,2020,새문안로2길 10
170424,38341,서울특별시 종로구 신문로2가,171,171,0,디팰리스,158,202107,7,360000,16,2020,새문안로2길 10
170425,38342,서울특별시 종로구 신문로2가,171,171,0,디팰리스,158,202104,14,375000,14,2020,새문안로2길 10
280119,31264,서울특별시 종로구 신문로2가,171,171,0,디팰리스,119,202303,16,285000,10,2020,새문안로2길 10
280120,31265,서울특별시 종로구 신문로2가,171,171,0,디팰리스,119,202312,11,280000,16,2020,새문안로2길 10
280121,31266,서울특별시 종로구 신문로2가,171,171,0,디팰리스,148,202306,24,408000,10,2020,새문안로2길 10

In [69]:
df.groupby("시군구")["거래금액(만원)"].mean().reset_index().sort_values(by="거래금액(만원)", ascending=False).head(5)

                 시군구  거래금액(만원)
287  서울특별시 종로구 신문로2가    322714
320   서울특별시 중구 장충동1가    251746
8     서울특별시 강남구 압구정동    207247
241  서울특별시 용산구 용산동5가    188139
304    서울특별시 종로구 홍파동    172629

In [71]:
#reset_index 인덱스를 일반적인 데이터 열(column)으로 바꾸고 기존 인덱스는 기본정수 인덱스(0, 1, 2)로 교체
df.groupby("건축년도")["거래금액(만원)"].mean().reset_index()

    건축년도  거래금액(만원)
0   1961     14797
1   1965     35294
2   1966     25804
3   1967     10195
4   1968     22904
5   1969     21616
6   1970     40231
7   1971     73059
8   1972     35010
9   1973    169419
10  1974    102795
11  1975     68749
12  1976    117090
13  1977     89101
14  1978    127368
15  1979    124540
16  1980     83058
17  1981     82461
18  1982     86206
19  1983     78439
20  1984     74135
21  1985     80155
22  1986     64296
23  1987     51319
24  1988     44051
25  1989     33892
26  1990     34676
27  1991     34956
28  1992     40938
29  1993     47365
30  1994     43801
31  1995     42554
32  1996     40011
33  1997     46744
34  1998     42252
35  1999     45299
36  2000     47592
37  2001     49905
38  2002     52781
39  2003     54432
40  2004     51683
41  2005     56411
42  2006     66956
43  2007     68609
44  2008     80719
45  2009     87799
46  2010     68895
47  2011     81395
48  2012     66983
49  2013     53217
50  2014     69522
51  2015     85099
52  2016    105594
53  2017     98885
54  2018    108529
55  2019    103241
56  2020     95834
57  2021     90360
58  2022     60282
59  2023     86640

In [75]:
df.groupby(["건축년도", "전용면적(㎡)"])["거래금액(만원)"].mean().reset_index()

       건축년도  전용면적(㎡)  거래금액(만원)
0      1961       27      3740
1      1961       36     13923
2      1961       45     11400
3      1961       48     12988
4      1961       49     16300
...     ...      ...       ...
29372  2023      102    482500
29373  2023      113    165500
29374  2023      117    546500
29375  2023      117    551500
29376  2023      134    630000

[29377 rows x 3 columns]